Bill_dealer_app/app/Http/Controllers/ClientController.php

select * from `clients`
---
    public function index()
    {
        $clients = Client::paginate(8);