Bill_dealer_app/app/Http/Controllers/CompanyController.php

    public function index()
    {
        return view(
            'indexCompany',
            [
                'post' => Company::all()
            ]
        );
---
select * from `companies`

    public function show($id)
    {
        $post = Company::findOrFail($id);
---
select * from `companies` where `companies`.`id` = '1' limit 1