Bill_dealer_app/app/Http/Controllers/ControllerTest.php

select * from `comandas`
---
    public function index()
    {
        $posts = Comanda::all();

select * from `comandas` where `comandas`.`id` = '8' limit 1
---
    public function show($id)
    {
        $post = Comanda::findOrFail($id);