Bill_dealer_app/app/Http/Controllers/UsersBillController.php

select * from `users_bills`
---
    public function index()
    {
        return view(
            'users_bill.usersIndex',
            [
                'users' => UsersBill::all()
            ]
        );

select * from `users_bills` where `users_bills`.`id` = '1' limit 1
---
    public function show($id)
    {
        return view(
            'users_bill.usersShow',
            [
                'user' => UsersBill::findOrFail($id)
            ]
        );